title: Failed login attemp
description: Detects failed logins
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4625
        LogonType: 3
    timeframe: 1m
    condition: selection | count(eventcount) by dst_ip > 10
fields:
  - src_ip
  - dst_ip
  - user
level: medium
